
🏗️ Terraform Plan
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.device["R9"].netbox_available_prefix.site_v4 will be created
  + resource "netbox_available_prefix" "site_v4" {
      + description      = "Site prefix for R9"
      + id               = (known after apply)
      + parent_prefix_id = 96
      + prefix           = (known after apply)
      + prefix_length    = 32
      + status           = "active"
    }

  # module.device["R9"].netbox_available_prefix.site_v6 will be created
  + resource "netbox_available_prefix" "site_v6" {
      + description      = "Site prefix for R9"
      + id               = (known after apply)
      + parent_prefix_id = 97
      + prefix           = (known after apply)
      + prefix_length    = 56
      + status           = "active"
    }

  # module.device["R9"].netbox_available_prefix.tunnels_v4["CR3"] will be created
  + resource "netbox_available_prefix" "tunnels_v4" {
      + description      = "Tunnel from CR3 to R9"
      + id               = (known after apply)
      + parent_prefix_id = 126
      + prefix           = (known after apply)
      + prefix_length    = 31
      + role_id          = 1
      + status           = "active"
    }

  # module.device["R9"].netbox_available_prefix.tunnels_v4["CR4"] will be created
  + resource "netbox_available_prefix" "tunnels_v4" {
      + description      = "Tunnel from CR4 to R9"
      + id               = (known after apply)
      + parent_prefix_id = 126
      + prefix           = (known after apply)
      + prefix_length    = 31
      + role_id          = 1
      + status           = "active"
    }

  # module.device["R9"].netbox_available_prefix.tunnels_v4["CR5"] will be created
  + resource "netbox_available_prefix" "tunnels_v4" {
      + description      = "Tunnel from CR5 to R9"
      + id               = (known after apply)
      + parent_prefix_id = 126
      + prefix           = (known after apply)
      + prefix_length    = 31
      + role_id          = 1
      + status           = "active"
    }

  # module.device["R9"].netbox_available_prefix.tunnels_v6["CR3"] will be created
  + resource "netbox_available_prefix" "tunnels_v6" {
      + description      = "Tunnel from CR3 to R9"
      + id               = (known after apply)
      + parent_prefix_id = 132
      + prefix           = (known after apply)
      + prefix_length    = 64
      + role_id          = 1
      + status           = "active"
    }

  # module.device["R9"].netbox_available_prefix.tunnels_v6["CR4"] will be created
  + resource "netbox_available_prefix" "tunnels_v6" {
      + description      = "Tunnel from CR4 to R9"
      + id               = (known after apply)
      + parent_prefix_id = 132
      + prefix           = (known after apply)
      + prefix_length    = 64
      + role_id          = 1
      + status           = "active"
    }

  # module.device["R9"].netbox_available_prefix.tunnels_v6["CR5"] will be created
  + resource "netbox_available_prefix" "tunnels_v6" {
      + description      = "Tunnel from CR5 to R9"
      + id               = (known after apply)
      + parent_prefix_id = 132
      + prefix           = (known after apply)
      + prefix_length    = 64
      + role_id          = 1
      + status           = "active"
    }

  # module.device["R9"].netbox_device_interface.lan["1"] will be created
  + resource "netbox_device_interface" "lan" {
      + description                = "Management"
      + device_id                  = 90
      + enabled                    = true
      + id                         = (known after apply)
      + name                       = "eth1.1"
      + parent_device_interface_id = 431
      + type                       = "virtual"
    }

  # module.device["R9"].netbox_device_interface.lan["2"] will be created
  + resource "netbox_device_interface" "lan" {
      + description                = "Access"
      + device_id                  = 90
      + enabled                    = true
      + id                         = (known after apply)
      + name                       = "eth1.2"
      + parent_device_interface_id = 431
      + type                       = "virtual"
    }

  # module.device["R9"].netbox_device_interface.tunnels["CR3"] will be created
  + resource "netbox_device_interface" "tunnels" {
      + description = "Tunnel to CR3"
      + device_id   = 90
      + enabled     = true
      + id          = (known after apply)
      + name        = "tun0"
      + type        = "virtual"
    }

  # module.device["R9"].netbox_device_interface.tunnels["CR4"] will be created
  + resource "netbox_device_interface" "tunnels" {
      + description = "Tunnel to CR4"
      + device_id   = 90
      + enabled     = true
      + id          = (known after apply)
      + name        = "tun1"
      + type        = "virtual"
    }

  # module.device["R9"].netbox_device_interface.tunnels["CR5"] will be created
  + resource "netbox_device_interface" "tunnels" {
      + description = "Tunnel to CR5"
      + device_id   = 90
      + enabled     = true
      + id          = (known after apply)
      + name        = "tun2"
      + type        = "virtual"
    }

  # module.device["R9"].netbox_device_primary_ip.v4 will be created
  + resource "netbox_device_primary_ip" "v4" {
      + device_id          = 90
      + id                 = (known after apply)
      + ip_address_id      = (known after apply)
      + ip_address_version = 4
    }

  # module.device["R9"].netbox_device_primary_ip.v6 will be created
  + resource "netbox_device_primary_ip" "v6" {
      + device_id          = 90
      + id                 = (known after apply)
      + ip_address_id      = (known after apply)
      + ip_address_version = 6
    }

  # module.device["R9"].netbox_ip_address.local_tunnel_address_v4["CR3"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v4" {
      + description           = "Peer address of R9 for CR3"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
    }

  # module.device["R9"].netbox_ip_address.local_tunnel_address_v4["CR4"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v4" {
      + description           = "Peer address of R9 for CR4"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
    }

  # module.device["R9"].netbox_ip_address.local_tunnel_address_v4["CR5"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v4" {
      + description           = "Peer address of R9 for CR5"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
    }

  # module.device["R9"].netbox_ip_address.local_tunnel_address_v6["CR3"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v6" {
      + description           = "Peer address of R9 for CR3"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
    }

  # module.device["R9"].netbox_ip_address.local_tunnel_address_v6["CR4"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v6" {
      + description           = "Peer address of R9 for CR4"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
    }

  # module.device["R9"].netbox_ip_address.local_tunnel_address_v6["CR5"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v6" {
      + description           = "Peer address of R9 for CR5"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
    }

  # module.device["R9"].netbox_ip_address.loopback_v4 will be created
  + resource "netbox_ip_address" "loopback_v4" {
      + description           = "Loopback address for R9"
      + device_interface_id   = 744
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
    }

  # module.device["R9"].netbox_ip_address.loopback_v6 will be created
  + resource "netbox_ip_address" "loopback_v6" {
      + description           = "Loopback address for R9"
      + device_interface_id   = 744
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
    }

  # module.device["R9"].netbox_ip_address.remote_tunnel_address_v4["CR3"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v4" {
      + description           = "Peer address of CR3 for R9"
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
    }

  # module.device["R9"].netbox_ip_address.remote_tunnel_address_v4["CR4"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v4" {
      + description           = "Peer address of CR4 for R9"
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
    }

  # module.device["R9"].netbox_ip_address.remote_tunnel_address_v4["CR5"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v4" {
      + description           = "Peer address of CR5 for R9"
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
    }

  # module.device["R9"].netbox_ip_address.remote_tunnel_address_v6["CR3"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v6" {
      + description           = "Peer address of CR3 for R9"
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
    }

  # module.device["R9"].netbox_ip_address.remote_tunnel_address_v6["CR4"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v6" {
      + description           = "Peer address of CR4 for R9"
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
    }

  # module.device["R9"].netbox_ip_address.remote_tunnel_address_v6["CR5"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v6" {
      + description           = "Peer address of CR5 for R9"
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
    }

  # module.device["R9"].netbox_ip_address.router_addresses_v4["1"] will be created
  + resource "netbox_ip_address" "router_addresses_v4" {
      + description           = "Local router address for 'Management' network on R9"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = "10.1.0.1/16"
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + vrf_id                = (known after apply)
    }

  # module.device["R9"].netbox_ip_address.router_addresses_v4["2"] will be created
  + resource "netbox_ip_address" "router_addresses_v4" {
      + description           = "Local router address for 'Access' network on R9"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = "10.2.0.1/16"
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + vrf_id                = (known after apply)
    }

  # module.device["R9"].netbox_ip_address.router_addresses_v6["1"] will be created
  + resource "netbox_ip_address" "router_addresses_v6" {
      + description           = "Local router address for 'Management' network on R9"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
    }

  # module.device["R9"].netbox_ip_address.router_addresses_v6["2"] will be created
  + resource "netbox_ip_address" "router_addresses_v6" {
      + description           = "Local router address for 'Access' network on R9"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
    }

  # module.device["R9"].netbox_prefix.local_v4 will be created
  + resource "netbox_prefix" "local_v4" {
      + description = "Local network for R9"
      + id          = (known after apply)
      + prefix      = "10.0.0.0/8"
      + status      = "active"
      + vrf_id      = (known after apply)
    }

  # module.device["R9"].netbox_prefix.loopback_v6 will be created
  + resource "netbox_prefix" "loopback_v6" {
      + description = "Loopback prefix for R9"
      + id          = (known after apply)
      + prefix      = (known after apply)
      + status      = "active"
    }

  # module.device["R9"].netbox_prefix.networks_v4["1"] will be created
  + resource "netbox_prefix" "networks_v4" {
      + description = "'Management' network for R9"
      + id          = (known after apply)
      + prefix      = "10.1.0.0/16"
      + status      = "active"
      + vlan_id     = (known after apply)
      + vrf_id      = (known after apply)
    }

  # module.device["R9"].netbox_prefix.networks_v4["2"] will be created
  + resource "netbox_prefix" "networks_v4" {
      + description = "'Access' network for R9"
      + id          = (known after apply)
      + prefix      = "10.2.0.0/16"
      + status      = "active"
      + vlan_id     = (known after apply)
      + vrf_id      = (known after apply)
    }

  # module.device["R9"].netbox_prefix.networks_v6["1"] will be created
  + resource "netbox_prefix" "networks_v6" {
      + description = "'Management' network for R9"
      + id          = (known after apply)
      + prefix      = (known after apply)
      + status      = "active"
      + vlan_id     = (known after apply)
    }

  # module.device["R9"].netbox_prefix.networks_v6["2"] will be created
  + resource "netbox_prefix" "networks_v6" {
      + description = "'Access' network for R9"
      + id          = (known after apply)
      + prefix      = (known after apply)
      + status      = "active"
      + vlan_id     = (known after apply)
    }

  # module.device["R9"].netbox_vlan.networks["1"] will be created
  + resource "netbox_vlan" "networks" {
      + group_id = (known after apply)
      + id       = (known after apply)
      + name     = "Management"
      + site_id  = 11
      + status   = "active"
      + vid      = 1
    }

  # module.device["R9"].netbox_vlan.networks["2"] will be created
  + resource "netbox_vlan" "networks" {
      + group_id = (known after apply)
      + id       = (known after apply)
      + name     = "Access"
      + site_id  = 11
      + status   = "active"
      + vid      = 2
    }

  # module.device["R9"].netbox_vlan_group.group will be created
  + resource "netbox_vlan_group" "group" {
      + id         = (known after apply)
      + max_vid    = 256
      + min_vid    = 1
      + name       = "R9"
      + scope_id   = 11
      + scope_type = "dcim.site"
      + slug       = "R9"
    }

  # module.device["R9"].netbox_vrf.local will be created
  + resource "netbox_vrf" "local" {
      + id   = (known after apply)
      + name = "R9"
    }

Plan: 43 to add, 0 to change, 0 to destroy.
```